---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.MEPCalculationFailures.Network_NotFullyConnected
source: html/6ad707a7-ce74-e16f-4e86-779e864f3faf.htm
---
# Autodesk.Revit.DB.BuiltInFailures.MEPCalculationFailures.Network_NotFullyConnected Property

The network is not well connected. Some elements may have unexpected flow and pressure loss values.

## Syntax (C#)
```csharp
public static FailureDefinitionId Network_NotFullyConnected { get; }
```